In [1]:
# import library 

import pandas as pd 
from datasets import load_dataset 
import matplotlib.pyplot as plt

# load data

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# data cleanup

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

/opt/anaconda3/envs/python_course/lib/python3.11/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [2]:
# Cleaning the dataset 

# replace all NAN values with median values - to clean data 
# remove any duplicate values 


df.loc[0:10, 'salary_year_avg' : 'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [7]:
median_salary_year = df['salary_year_avg'].median()

In [5]:
median_salary_hour = df["salary_hour_avg"].median()

In [9]:
df_filled = df

df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [13]:
df_filled.loc[0:10, "salary_year_avg" : "salary_hour_avg"]

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [14]:
# removing duplicates from df

df_unique = df_filled

df_unique = df_unique.drop_duplicates()

In [17]:
len(df_filled)
len(df_unique)

785640

In [18]:
df_unique = df_unique.drop_duplicates(subset = ["job_title", "company_name"])

In [19]:
len(df_unique)

508042